test/control.txt

#
# NGINX Welcome Page
#
[root@ip-172-16-1-152 test]# /lambda-load-test/test/wrk/wrk -t1 -c10 -d30s http://172.16.1.72
Running 30s test @ http://172.16.1.72
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   241.88us   37.97us   1.35ms   85.11%
    Req/Sec    40.20k   605.12    41.87k    72.33%
  1199811 requests in 30.00s, 4.48GB read
Requests/sec:  39992.99
Transfer/sec:    152.90MB

#
# Cloudfront to Lambda without timeout
#
[root@ip-172-16-1-152 test]# /lambda-load-test/test/wrk/wrk -t1 -c10 -d30s https://vl43qi8gcf.execute-api.us-east-1.amazonaws.com/dev/test
Running 30s test @ https://vl43qi8gcf.execute-api.us-east-1.amazonaws.com/dev/test
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.21ms   66.27ms   1.01s    96.23%
    Req/Sec   420.41     71.19   510.00     85.00%
  12571 requests in 30.04s, 20.04MB read
Requests/sec:    418.53
Transfer/sec:    683.06KB

#
# Node backend (no lambda call) without timeout
#
[root@ip-172-16-1-152 test]# /lambda-load-test/test/wrk/wrk -t1 -c10 -d30s http://172.16.1.72/api?node=true
Running 30s test @ http://172.16.1.72/api?node=true
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.58ms   31.52ms 639.53ms   99.05%
    Req/Sec     2.55k     1.37k    4.85k    67.67%
  76178 requests in 30.02s, 126.75MB read
  Non-2xx or 3xx responses: 31153
Requests/sec:   2537.60
Transfer/sec:      4.22MB

#
# Nginx to Node backend to Lambda without timeout
#
[root@ip-172-16-1-152 test]# /lambda-load-test/test/wrk/wrk -t1 -c10 -d30s http://172.16.1.72/api
Running 30s test @ http://172.16.1.72/api
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   173.13ms  274.38ms   1.08s    83.97%
    Req/Sec   296.08    112.33   430.00     77.49%
  5911 requests in 30.05s, 3.46MB read
Requests/sec:    196.73
Transfer/sec:    117.76KB

#
# Node backend to Lambda without timeout (Same EC2 as node.js)
# Express.js
#
[root@ip-172-16-1-72 wrk]# ./wrk -t1 -c10 -d30s -H "x-FunctionName: test-dev-test" http://localhost:3000
Running 30s test @ http://localhost:3000
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   167.31ms  271.06ms   1.05s    83.98%
    Req/Sec   327.94    129.78   490.00     78.17%
  6667 requests in 30.05s, 3.44MB read
Requests/sec:    221.89
Transfer/sec:    117.23KB

#
# Node backend to Lambda without timeout (Same EC2 as node.js)
# node.js
#
[root@ip-172-16-1-72 wrk]# ./wrk -t1 -c20 -d30s -H "x-FunctionName: test-dev-test" http://localhost:3001
Running 30s test @ http://localhost:3001
  1 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   234.22ms  331.84ms   1.97s    84.96%
    Req/Sec   244.61     88.20   360.00     79.90%
  5181 requests in 30.04s, 1.56MB read
Requests/sec:    172.49
Transfer/sec:     53.06KB

#
# Use node to execute calls to lambda
#
[root@ip-172-16-1-72 http-proxy]# node test.js 10
info: 10 - 131ms - 87.4 avg. ms
[root@ip-172-16-1-72 http-proxy]# node test.js 100
info: 100 - 513 - 306.86
[root@ip-172-16-1-72 http-proxy]# node test.js 1000
info: 1000 - 3874 - 2203.555
[root@ip-172-16-1-72 http-proxy]# node test.js 10000
info: 10000 - 37370 - 20516.2411
