test/results2.txt
Running 5m test @ http://172.16.1.72/api?ec2_timeout=20
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    53.26ms   48.98ms   1.08s    98.07%
    Req/Sec    20.38      4.70    30.00     78.19%
  6049 requests in 5.00m, 3.75MB read
Requests/sec:     20.16
Transfer/sec:     12.80KB

Running 5m test @ http://172.16.1.72/api?ec2_timeout=20
  1 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    60.93ms  100.22ms   1.82s    97.87%
    Req/Sec    40.53      8.24    60.00     56.90%
  12074 requests in 5.00m, 7.48MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:     40.24
Transfer/sec:     25.54KB

Running 5m test @ http://172.16.1.72/api?ec2_timeout=20
  1 threads and 3 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    56.36ms   73.23ms   1.23s    97.77%
    Req/Sec    62.51     10.36    90.00     73.30%
  18691 requests in 5.00m, 11.59MB read
Requests/sec:     62.30
Transfer/sec:     39.54KB

Running 5m test @ http://172.16.1.72/api?ec2_timeout=20
  1 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    57.80ms   76.18ms   1.22s    97.74%
    Req/Sec    81.58     12.28   120.00     80.90%
  24351 requests in 5.00m, 15.09MB read
Requests/sec:     81.15
Transfer/sec:     51.51KB

Running 5m test @ http://172.16.1.72/api?ec2_timeout=20
  1 threads and 5 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    72.63ms  130.52ms   1.97s    96.27%
    Req/Sec    96.92     17.52   140.00     83.96%
  27762 requests in 5.00m, 17.21MB read
  Socket errors: connect 0, read 0, write 0, timeout 25
Requests/sec:     92.52
Transfer/sec:     58.73KB

Running 5m test @ http://172.16.1.72/api?ec2_timeout=20
  1 threads and 6 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    79.02ms  138.14ms   2.00s    95.24%
    Req/Sec   107.98     24.72   160.00     80.66%
  29712 requests in 5.00m, 18.42MB read
  Socket errors: connect 0, read 0, write 0, timeout 75
Requests/sec:     99.01
Transfer/sec:     62.84KB

Running 5m test @ http://172.16.1.72/api?ec2_timeout=20
  1 threads and 7 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    95.92ms  161.68ms   1.18s    93.18%
    Req/Sec   124.55     27.24   190.00     86.19%
  33851 requests in 5.00m, 20.98MB read
  Socket errors: connect 0, read 0, write 0, timeout 58
Requests/sec:    112.81
Transfer/sec:     71.60KB

Running 5m test @ http://172.16.1.72/api?ec2_timeout=20
  1 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   102.67ms  180.89ms   1.99s    92.83%
    Req/Sec   142.65     31.45   202.00     83.35%
  38232 requests in 5.00m, 23.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 65
Requests/sec:    127.42
Transfer/sec:     80.87KB

Running 5m test @ http://172.16.1.72/api?ec2_timeout=20
  1 threads and 9 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   107.61ms  189.33ms   1.97s    92.36%
    Req/Sec   160.29     35.91   230.00     85.45%
  42956 requests in 5.00m, 26.63MB read
  Socket errors: connect 0, read 0, write 0, timeout 53
Requests/sec:    143.16
Transfer/sec:     90.87KB

Running 10m test @ http://172.16.1.72/api?ec2_timeout=20
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   109.81ms  186.99ms   1.81s    92.05%
    Req/Sec   175.09     42.22   250.00     84.85%
  92466 requests in 10.00m, 57.31MB read
  Socket errors: connect 0, read 0, write 0, timeout 127
Requests/sec:    154.09
Transfer/sec:     97.80KB